'''
Известно, что генеральная совокупность распределена нормально со средним квадратическим отклонением, равным 16.

Найти доверительный интервал для оценки математического ожидания a с надежностью 0.95, если выборочная средняя M = 80, а объем выборки n = 256.
'''

import numpy as np
from scipy import stats
m = 80
sigma = 16
n = 256
p = 0.95
alpha = 0.05
z = stats.norm.ppf(alpha/2)
print(f'Доверительный интервал для оценки математического ожидания: {(m - z * sigma / np.sqrt(n), m + z * sigma / np.sqrt(n))}')